Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ErasedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Int32)
When the dependent-on object (such as an Dimension) is erased, the corresponding AssocVariable is also erased.
isErasing:  Boolean isErasing.
pDbObj:  The controlled entity.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SubErase(System.Int32)
Overridden method from the DBObject base class. It erases the controlled entity, such as the Dimension.
erasing:  Boolean erasing.