Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings
This .NET class wraps the AcDbMentalRayRenderSettings ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.Sampling
Accesses the minimum and maximum numbers of samples to take when shading a pixel during rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.SamplingFilter
Accesses the filtering parameters for combining multiple samples into a single pixel color.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.SamplingContrastColor
Accesses the threshold above which further samples will be taken, per color channel. When performing sampling, the renderer will compare a sample to its surrounding samples, and take further samples if the difference is greater than the threshold value.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ShadowMode
Accesses the method used to compute ray-traced shadows.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ShadowMapsEnabled
Accesses a Boolean value indicating whether shadow maps are computed.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.RayTracingEnabled
Accesses a Boolean value indicating whether ray-tracing is performed.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.RayTraceDepth
Accesses the maximum trace depth (recursion level) for rays.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GlobalIlluminationEnabled
Accesses a Boolean value indicating whether global illumination (using photon mapping) is computed.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GISampleCount
Accesses the maximum number of photons near a render sample point to use for computing global illumination.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GISampleRadiusEnabled
Accesses a Boolean value indicating whether the user-defined photon sampling radius is used.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GISampleRadius
Accesses the radius of the area used to sample photons for global illumination.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GIPhotonsPerLight
Accesses the average number of GI photons to shoot for each light.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.PhotonTraceDepth
Accesses the maximum trace depth (recursion level) for photons.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FinalGatheringEnabled
Accesses a Boolean value indicating whether final gathering is applied.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FGRayCount
Accesses the number of final gather rays to be used for each final gather point.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FGSampleRadiusState
Accesses the flags indicating whether the user-defined final gathering sampling radii are used, and what units they are defined in.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FGSampleRadius
Accesses the minimum and maximum radii of the area used to sample final gather points to compute indirect illumination.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticMode
Accesses the mode used for rendering diagnostic images.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticGridMode
Accesses the coordinate system to use for the diagnostic grid, including the distance between grid lines (size).

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticPhotonMode
Accesses the type of photon information to visualize with the photon diagnostic mode.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticBSPMode
Accesses the type of BSP information to visualize with the BSP diagnostic mode.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ExportMIEnabled
Assesses whether to export an MI file after rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ExportMIFileName
Accesses the full path and file name to use for an exported MI file.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.TileSize
Accesses the size of the image tiles.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.TileOrder
Accesses the image tiles.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.MemoryLimit
Accesses the maximum amount of memory (in MB) that the renderer will allocate for rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.EnergyMultiplier
Accesses the energy multiplier value.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FinalGatheringMode
Accesses the final gathering mode.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ShadowSamplingMultiplier
Accesses the shadow sampling multiplier for area lights.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.LightLuminanceScale
Accesses the physical scale factor to use with lights that are not physically based.