Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.#ctor(System.Single,System.Single,System.Single,System.Single)
Constructs a new object.
red:  Input red channel value
green:  Input green channel value
blue:  Input blue channel value
alpha:  Input alpha channel value

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.R
Returns red channel value.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.G
Returns green channel value.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.B
Returns blue channel value.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.A
Returns alpha channel value.