Autodesk.AutoCAD.DatabaseServices.PointCloudEx
This is class Autodesk.AutoCAD.DatabaseServices.PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.GetColorSchemeForStylization(Autodesk.AutoCAD.DatabaseServices.PointCloudStylizationType)
This is GetColorSchemeForStylization, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.SetColorSchemeForStylization(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudStylizationType)
This is SetColorSchemeForStylization, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.HasProperty(Autodesk.AutoCAD.DatabaseServices.PointCloudProperty)
This is HasProperty, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.MinMaxIntensity
This is MinMaxIntensity, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.IntensityOutOfRangeBehavior
This is IntensityOutOfRangeBehavior, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.CurrentColorScheme
This is CurrentColorScheme, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.MinMaxElevation
This is MinMaxElevation, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ElevationApplyToFixedRange
This is ElevationApplyToFixedRange, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ElevationOutOfRangeBehavior
This is ElevationOutOfRangeBehavior, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.IntensityGradient
This is IntensityGradient, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ElevationGradient
This is ElevationGradient, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.LimitBoxBound
This is LimitBoxBound, a member of class PointCloudEx.