Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.Min
Returns minimum sampling rate, in the range -3 to 5. Values less than zero enable subsampling. -3 corresponds to one sample for every 64 pixel (1/64) and 5 corresponds to 1024 samples per pixel. The default value is -1.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.Max
Returns maximum sampling rate, in the range -3 to 5.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.Pixels
Pixels to be shaded while rendering.