Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.Mode
Returns the coordinate system used to display grid.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.Size
Returns distance between grid lines.