Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ErasedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Int32)
Called from the corresponding persistent reactor callback method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.