Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.#ctor(System.Int32,System.Int32,System.Int32)
Constructor.
reflect:  Input maximum recursion level of reflection rays, greater than or equal to 0. The default value is 2.
refract:  Input maximum recursion level of refraction rays, greater than or equal to 0. The default value is 2.
s:  Input maximum recursion level of reflection and refraction rays, combined. The default value is 4.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.Reflection
Returns the maximum recursion level of reflection rays, greater than or equal to 0. Default value is 2.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.Refraction
Returns the maximum recursion level of refraction rays, greater than or equal to 0. Default value is 2.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.Sum
Returns the maximum recursion level of reflection and refraction rays, combined. Default value is 4.