Autodesk.AutoCAD.GraphicsInterface.DiagnosticPhotonMode
This .NET enum wraps the AcGiMrDiagnosticPhotonMode ObjectARX enum. It gives the type of photon information to visualize with the photon diagnostic mode.