Autodesk.AutoCAD.DatabaseServices.PointCloudItem
This is class Autodesk.AutoCAD.DatabaseServices.PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.#ctor
This is PointCloudItem, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Clone
This is Clone, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.CompareTo(Autodesk.AutoCAD.DatabaseServices.PointCloudItem)
This is CompareTo, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.ToCmdString
This is ToCmdString, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.CreatePointCloudDataItemCollection(System.IntPtr)
This is CreatePointCloudDataItemCollection, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.ItemId
This is ItemId, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Name
This is Name, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.ProjectName
This is ProjectName, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Guid
This is Guid, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Visibility
This is Visibility, a member of class PointCloudItem.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.CategoryId
This is CategoryId, a member of class PointCloudItem.