Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter.#ctor(System.Double,System.Double)
Constructs a new object.
a:  Input minimum final gather sample radius
b:  Input maximum final gather sample radius

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter.Min
Returns the Min property value.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter.Max
Returns the Max property value.