Autodesk.AutoCAD.Geometry.Interval.#ctor(System.Int32,System.Double,System.Double)
Constructor that creates an interval with the upper bound equal to bound. If the value of the argument boundedBelow is true, then it sets the lower bound also to bound, otherwise the interval remains unbounded below. Sets the boundary tolerance to the value tolerance.
boundedBelow:  Whether to set a lower bound or leave interval unbounded below
bound:  Upper or lower bound
tolerance:  Input tolerance value