Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.Width
Returns width of the filter area, in the range 0.0 to 8.0, in pixels. The default is 1.0.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.Height
Returns the height of the filter area, in the range 0.0 to 8.0, in pixels. The default is 1.0.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.Filter
Filtering method (kernel) used to combine samples into a pixel color.