Autodesk.AutoCAD.GraphicsInterface.DiagnosticBSPMode
This .NET enum wraps the AcGiMrDiagnosticBSPMode ObjectARX enum. It gives the available types of BSP information to visualize with the BSP diagnostic mode.