Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter.#ctor(System.Int32,System.Int32)
Constructs a new object.
a:  Input minimum sampling rate
b:  Input maximum sampling rate

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter.Min
Returns the Min property value.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter.Max
Returns the Max property value.