Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits
This .NET class wraps the AcGiMentalRayRenderSettingsTraits ObjectARX class. It represents mental ray specific render settings to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.Sampling
Returns the minimum and maximum numbers of samples to take when shading a pixel during rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.SamplingFilter
Returns the filtering parameters for combining multiple samples into a single pixel color.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.SamplingContrastColor
Returns the threshold above which further samples will be taken, per color channel.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ShadowMode
The method used to compute ray-traced shadows.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ShadowMapEnabled
Returns true if shadow maps are computed.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.RayTraceEnabled
Returns a Boolean indicating whether ray-tracing is performed.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.RayTraceDepth
Returns the maximum trace depth (recursion level) for rays.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GlobalIlluminationEnabled
Returns a Boolean indicating whether global illumination (using photon mapping) is computed.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GISampleCount
Returns the maximum number of photons near a render sample point to use for computing global illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GISampleRadiusEnabled
Returns a Boolean indicating whether the user-defined photon sampling radius is used.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GISampleRadius
Returns radius of the area used to sample photons for global illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GIPhotonsPerLight
Returns the average number of GI photons to shoot for each light. The default value is 10000.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.PhotonTraceDepth
Returns the maximum trace depth (recursion level) for photons.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FinalGatheringEnabled
Returns boolean indicating whether final gathering is applied.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FGRayCount
Returns the number of final gather rays to be used for each final gather point.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FGSampleRadiusState
Returns the flags indicating which user-defined final gathering sampling radii are used, and what units they are defined in.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FGSampleRadius
Returns the minimum and maximum radii of the area used to sample final gather points to compute indirect illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.LightLuminanceScale
Returns the luminance scale.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticMode
Returns the type of diagnostic mode being used.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticGridMode
Returns the coordinate system to use for the diagnostic grid including the distance between grid lines (size).

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticPhotonMode
Returns the type of photon information to visualize with the photon diagnostic mode.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticBSPMode
Returns the type of diagnostic BSP mode in use.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ExportMIEnabled
Returns Boolean indicating whether to export an MI file after rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ExportMIFileName
Returns the full path and file name to use for an exported MI file.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.TileSize
Returns the size of the image tiles to use when rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.TileOrder
Returns the sequence (order) used to render image tiles.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.MemoryLimit
Returns the maximum amount of memory (in MB) that the renderer will allocate for rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ProgressMonitor
Returns a pointer to the progress monitor.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticBackgroundEnabled
Returns the DiagnosticBackgroundEnabled property value.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ModelScaleFactor
Returns the model scale factor relative to meters. For example, if the model is drawn in mm, the scale factor is 0.001.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.EnergyMultiplier
Returns the energy multiplier value. This value is used to control the magnitude of indirect illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ExposureType
Accesses the exposure control type.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FinalGatheringMode
Accesses the final gathering mode. Final gathering allows for indirect illumination effects such as color-bleeding, and can be combined with global illumination to enhance the effect of GI.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ShadowSamplingMultiplier
Accesses the shadow sampling multiplier for area lights.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.MrExportMIMode
This is MrExportMIMode, a member of class MentalRayRenderSettingsTraits.